import { Component } from '@angular/core';

@Component({
  selector: 'app-news',
  standalone: true,
  imports: [],
  templateUrl: 'news.component.html',
  styleUrl: 'news.component.scss'
})
export default class NewsComponent {
  newsData: any = {
    image: '../../../assets/news-page/image.png',
    locationName: 'Барбершоп BARRACUDA',
    title: 'Приведи друга і отримай знижку 50% на наступний візит',
    description: `Уявіть собі захопливу пропозицію, створену для того, щоб додати більше радості та економії вашому спілкуванню з друзями! Ця кампанія - це все про спільне ділення радості та переваг. Коли ви запрошуєте своїх друзів приєднатися до веселощів, ви не тільки знайомите їх з чудовим часом, а й відкриваєте для себе фантастичну винагороду. Ось як це працює:
    Пропозиція: Як знак вдячності за поширення інформації, ви отримаєте неймовірну знижку 50% на ваш наступний візит. Це наш спосіб сказати дякую за те, що ви така цінна частина нашої спільноти і допомагаєте їй рости.
    Як взяти участь: Просто поділіться запрошенням зі своїми друзями приєднатися і насолоджуватися тим, що ми пропонуємо. Це може бути через соціальні мережі, безпосереднє запрошення або будь-який інший зручний для вас спосіб. Процес має бути легким та зрозумілим, щоб кожен міг взяти участь без будь-яких складнощів.
    Винагорода: Як тільки ваші друзі приймуть ваше запрошення, на ваш рахунок буде нараховано знижку 50% на ваш наступний візит. Ця значна економія означає, що ви можете насолоджуватися всім, що ми пропонуємо, за половину ціни, роблячи ваш досвід ще більш приємним і незабутнім.
    Чому ділитися? Це більше, ніж просто акція; це можливість створити незабутні моменти з вашими друзями. Ділячись цим досвідом, ви не тільки економите гроші; ви будуєте спогади, які залишаться з вами на все життя. Крім того, це шанс показати вашим друзям місця та заходи, які вам подобаються, ще більше зміцнюючи ваші зв'язки.`,
    date: '13/02/2023'
  }
}
